1.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://webservices.kazpost.kz/qiwi/schema">
                         <soapenv:Header/>
                         <soapenv:Body>
                            <sch:CheckPaymentRequest>                              
                               <sch:payId>14319780</sch:payId>
                               <sch:fromCurrency>643</sch:fromCurrency>
                               <sch:fromAmount>1.00</sch:fromAmount>
                               <sch:toCurrency>643</sch:toCurrency>
                               <sch:toAmount>1.00</sch:toAmount>
                               <sch:service>644</sch:service>
                               <sch:account>7789253550</sch:account>
                               <sch:recId>14319780</sch:recId> 
                               <sch:date>2018-01-19T16:16:15</sch:date>
                            </sch:CheckPaymentRequest>
                         </soapenv:Body>
                      </soapenv:Envelope>


<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <ns2:CheckPaymentResponse xmlns:ns2="http://webservices.kazpost.kz/qiwi/schema">
      <ns2:checkResult>0</ns2:checkResult>
      <ns2:fatal>false</ns2:fatal>
      <ns2:id>14319780</ns2:id>
      <ns2:payResult>0</ns2:payResult>
      <ns2:saved>false</ns2:saved>
      <ns2:status>3</ns2:status>
      <ns2:uid>21642360717008</ns2:uid>
      <ns2:parserHost>s1130.qiwi.com</ns2:parserHost>
      <ns2:ResponseInfo>
        <ns2:ResponseGenTime>2018-01-19T16:16:22.792+06:00</ns2:ResponseGenTime>
        <ns2:ResponseCode>0</ns2:ResponseCode>
        <ns2:ResponseText>success</ns2:ResponseText>
      </ns2:ResponseInfo>
    </ns2:CheckPaymentResponse>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
