3.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://webservices.kazpost.kz/qiwi/schema">
               <soapenv:Header/>
               <soapenv:Body>
                  <sch:AddOfflinePaymentRequest>                   
                     <sch:payId>1943579277</sch:payId>
                     <sch:fromCurrency>643</sch:fromCurrency>
                     <sch:fromAmount>200</sch:fromAmount>
                     <sch:toCurrency>643</sch:toCurrency>
                     <sch:toAmount>200</sch:toAmount>
                     <sch:service>644</sch:service>
                     <sch:account>7789253550</sch:account>
                     <sch:recId>285624797</sch:recId>
                     <sch:date>2018-01-19T16:17:16</sch:date>
                  </sch:AddOfflinePaymentRequest>
               </soapenv:Body>
            </soapenv:Envelope>


<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <ns2:AddOfflinePaymentResponse xmlns:ns2="http://webservices.kazpost.kz/qiwi/schema">
      <ns2:paymentResult>0</ns2:paymentResult>
      <ns2:date>2018-01-19T13:17:19+03:00</ns2:date>
      <ns2:fatal>false</ns2:fatal>
      <ns2:id>1943579277</ns2:id>
      <ns2:payResult>0</ns2:payResult>
      <ns2:saved>true</ns2:saved>
      <ns2:status>1</ns2:status>
      <ns2:uid>21642365278008</ns2:uid>
      <ns2:parserHost>s1128.qiwi.com</ns2:parserHost>
      <ns2:ResponseInfo>
        <ns2:ResponseGenTime>2018-01-19T16:17:15.676+06:00</ns2:ResponseGenTime>
        <ns2:ResponseCode>0</ns2:ResponseCode>
        <ns2:ResponseText>success</ns2:ResponseText>
      </ns2:ResponseInfo>
    </ns2:AddOfflinePaymentResponse>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
